app/Controllers/Admin/AdminController.php

SELECT *
FROM `usuarios`
ORDER BY `id` DESC
---
    public function index()
    {
        $usuarioModel = new UsuarioModel();
        $usuarios = $usuarioModel->orderBy('id', 'DESC')->findAll();