app/Controllers/RegistroController.php

INSERT INTO `usuarios` (`perfil`, `username`, `nombre`, `apaterno`, `amaterno`, `email`, `telefono`, `password`, `sexo`, `status`, `fecha_nacimiento`, `created_at`, `updated_at`) VALUES (1, 'admin', 'Edgar', 'Degante', 'Aguilar', 'edgar.degante.a@gmail.com', '2312051120', '$2y$10$CL33YZ3sVTwbWJt.l5BMzeNR23ARcJRTcm7.OpR0tXAl.72MNUVTq', 'm', 1, '1988-06-18', '2024-04-04 22:39:18', '2024-04-04 22:39:18')
---
    public function create()
    {
        $data = [
            'perfil'            => 1,
            'username'          => $this->request->getVar('username'),
            'nombre'            => $this->request->getVar('nombre'),
            'apaterno'          => $this->request->getVar('apaterno'),
            'amaterno'          => $this->request->getVar('amaterno'),
            'email'             => $this->request->getVar('email'),
            'telefono'          => $this->request->getVar('telefono'),
            'password'          => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'sexo'              => $this->request->getVar('sexo'),
            'status'            => 1,
            'fecha_nacimiento'  => $this->request->getVar('fecha_nacimiento')
        ];

        $rules = [
            'username'      => 'required|is_unique[usuarios.username]',
            'password'      => 'required|min_length[8]|max_length[30]',
            'email'         => 'required|valid_email|is_unique[usuarios.email]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->to('registro')->withInput()->with('errors', $this->validator->getErrors());
        }


        $this->usuarioModel->insert($data);